//=======================================================================================================================================================================================================================================================
/**
 * * Создает функционал product-slider
 */
//=======================================================================================================================================================================================================================================================
(async () => {
   const {default: Swiper, Keyboard, Navigation, Lazy} = await import(/* webpackPreload: true */ "swiper");
   new Swiper(".js_e-swiper-product", {
      centeredSlides: true,
      grabCursor: true,
      slidesPerView: 2,
      spaceBetween: 30,
      loop: true,
      preloadImages: false,
      lazy: {
         loadPrevNext: true,
      },
      autoplay: {
         delay: 500,
         disableOnInteraction: false, // Установите значение false, и авто воспроизведение не будет отключено после взаимодействия с пользователем, оно будет перезапускаться каждый раз после взаимодействия.
         pauseOnMouseEnter: true,
         // stopOnLastSlide: true, // Остановить на последнем
      },
   });
})();
//=======================================================================================================================================================================================================================================================